inference/inference-LEONARDO/results/vllm/sharegpt/gemma-3-12b-it/Nodes_8-GPUs_32-TP_4-PP_1-MaxModelLength_4096/launch-1/logs_benchmarking_150-concurrency.log
INFO 04-02 10:03:06 [__init__.py:244] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', dataset=None, dataset_name='sharegpt', dataset_path='/leonardo_work/MNRVA_bench/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', max_concurrency=150, model='/leonardo_work/MNRVA_bench/models/gemma-3-12b-it', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=1000, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, metadata=None, result_dir=None, result_filename='/leonardo_work/MNRVA_bench/minerva-benchmarks/inference/inference-LEONARDO/results/vllm/sharegpt/gemma-3-12b-it/Nodes_8-GPUs_32-TP_4-PP_1-MaxModelLength_4096/launch-1/Concurrency_150.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=1.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto')
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 150
============ Serving Benchmark Result ============
Successful requests:                     975       
Benchmark duration (s):                  135.73    
Total input tokens:                      222947    
Total generated tokens:                  198916    
Request throughput (req/s):              7.18      
Output token throughput (tok/s):         1465.54   
Total Token throughput (tok/s):          3108.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          392.58    
Median TTFT (ms):                        151.69    
P99 TTFT (ms):                           2409.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          78.70     
Median TPOT (ms):                        75.45     
P99 TPOT (ms):                           97.00     
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.71     
Median ITL (ms):                         74.56     
P99 ITL (ms):                            121.19    
==================================================